test/multipleBodies/twoFreeBoxes3D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     floatStepper;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;
maxAlphaCo      0.2;
maxDeltaT       1;

functions
{
    floaterMotion
    {
        type           floaterStateWriter;
        libs           (floaterStateWriter);
        writeControl   timeStep;
        writeInterval  1;
        bodyName       box;
        classicWriteFormat false;
    }

    addedMass
    {
        type           addedMassWriter;
        libs           (addedMassWriter);
        writeControl   timeStep;
        writeInterval  1;
        bodyName       box;
    }

    floaterMotion2
    {
        type           floaterStateWriter;
        libs           (floaterStateWriter);
        writeControl   timeStep;
        writeInterval  1;
        bodyName       box2;
        classicWriteFormat false;
    }

    addedMass2
    {
        type           addedMassWriter;
        libs           (addedMassWriter);
        writeControl   timeStep;
        writeInterval  1;
        bodyName       box2;
    }

    /*
    forces
    {
        type            forces;
        libs            ("libforces.so");
        patches         (floatingObject);
        rhoInf          998.8;
        log             on;
        writeControl    timeStep;
        writeInterval   1;
        #include "../constant/CofR"
    }
*/
}

// ************************************************************************* //
